# Pandas groupby Function 
### pandas groupby function is used to split the data into groups based on some criteria
### Syntax : DataFrame.groupby()
## GroupBy Operations:
### Splitting the object , Applying a function , Combining the result

In [1]:
import pandas as pd

In [2]:
df = pd.read_csv("C:\\Users\IT's MRK\Desktop\Learning\Pandas\Book4.csv")
df

         Date  Std ID  Class  Study hr  Percentage
0    1/1/2003  1001.0     10       2.0        50.0
1    1/2/2003  1002.0     10       NaN        60.0
2    1/3/2003     NaN     10       3.0        80.0
3    1/4/2003     NaN     11       0.0         NaN
4    1/5/2003  1005.0     11       4.0         NaN
5    1/6/2003     NaN     11      10.0        80.0
6    1/7/2003  1007.0     12       4.0        90.0
7    1/8/2003  1008.0     12       NaN        60.0
8    1/9/2003  1009.0     12       NaN        85.0
9   1/10/2003  1010.0     12       NaN         NaN
10  1/11/2003  1011.0     12       6.0        50.0

In [4]:
grp1 = df.groupby(by = 'Class')
grp1

In [5]:
grp1.groups

{10: Int64Index([0, 1, 2], dtype='int64'),
 11: Int64Index([3, 4, 5], dtype='int64'),
 12: Int64Index([6, 7, 8, 9, 10], dtype='int64')}

In [22]:
grp2 = df.groupby(by = 'Percentage').groups
grp2

{50.0: Int64Index([0, 10], dtype='int64'),
 60.0: Int64Index([1, 7], dtype='int64'),
 80.0: Int64Index([2, 5], dtype='int64'),
 85.0: Int64Index([8], dtype='int64'),
 90.0: Int64Index([6], dtype='int64')}

In [9]:
grp1 = df.groupby(['Class','Percentage'])
grp1

In [16]:
grp1 = df.groupby(['Class','Percentage']).groups
grp1

{(10, 50.0): Int64Index([0], dtype='int64'),
 (10, 60.0): Int64Index([1], dtype='int64'),
 (10, 80.0): Int64Index([2], dtype='int64'),
 (11, nan): Int64Index([3], dtype='int64'),
 (11, nan): Int64Index([4], dtype='int64'),
 (11, 80.0): Int64Index([5], dtype='int64'),
 (12, 60.0): Int64Index([7], dtype='int64'),
 (12, 85.0): Int64Index([8], dtype='int64'),
 (12, 90.0): Int64Index([6], dtype='int64'),
 (12, nan): Int64Index([9], dtype='int64'),
 (12, 50.0): Int64Index([10], dtype='int64')}

In [18]:
for Percentage, df_1 in grp1:
    print(Percentage)
    print(df_1)

10
50.0
10
60.0
10
80.0
11
nan
11
nan
11
80.0
12
60.0
12
85.0
12
90.0
12
nan
12
50.0

In [24]:
grp1 = df.groupby(by = 'Class')
grp1

In [25]:
for Class, df_1 in grp1:
    print(Class)
    print(df_1)

10
       Date  Std ID  Class  Study hr  Percentage
0  1/1/2003  1001.0     10       2.0        50.0
1  1/2/2003  1002.0     10       NaN        60.0
2  1/3/2003     NaN     10       3.0        80.0
11
       Date  Std ID  Class  Study hr  Percentage
3  1/4/2003     NaN     11       0.0         NaN
4  1/5/2003  1005.0     11       4.0         NaN
5  1/6/2003     NaN     11      10.0        80.0
12
         Date  Std ID  Class  Study hr  Percentage
6    1/7/2003  1007.0     12       4.0        90.0
7    1/8/2003  1008.0     12       NaN        60.0
8    1/9/2003  1009.0     12       NaN        85.0
9   1/10/2003  1010.0     12       NaN         NaN
10  1/11/2003  1011.0     12       6.0        50.0

In [27]:
list(grp1)

[(10,        Date  Std ID  Class  Study hr  Percentage
  0  1/1/2003  1001.0     10       2.0        50.0
  1  1/2/2003  1002.0     10       NaN        60.0
  2  1/3/2003     NaN     10       3.0        80.0),
 (11,        Date  Std ID  Class  Study hr  Percentage
  3  1/4/2003     NaN     11       0.0         NaN
  4  1/5/2003  1005.0     11       4.0         NaN
  5  1/6/2003     NaN     11      10.0        80.0),
 (12,          Date  Std ID  Class  Study hr  Percentage
  6    1/7/2003  1007.0     12       4.0        90.0
  7    1/8/2003  1008.0     12       NaN        60.0
  8    1/9/2003  1009.0     12       NaN        85.0
  9   1/10/2003  1010.0     12       NaN         NaN
  10  1/11/2003  1011.0     12       6.0        50.0)]

In [29]:
dict(list(grp1))

{10:        Date  Std ID  Class  Study hr  Percentage
 0  1/1/2003  1001.0     10       2.0        50.0
 1  1/2/2003  1002.0     10       NaN        60.0
 2  1/3/2003     NaN     10       3.0        80.0,
 11:        Date  Std ID  Class  Study hr  Percentage
 3  1/4/2003     NaN     11       0.0         NaN
 4  1/5/2003  1005.0     11       4.0         NaN
 5  1/6/2003     NaN     11      10.0        80.0,
 12:          Date  Std ID  Class  Study hr  Percentage
 6    1/7/2003  1007.0     12       4.0        90.0
 7    1/8/2003  1008.0     12       NaN        60.0
 8    1/9/2003  1009.0     12       NaN        85.0
 9   1/10/2003  1010.0     12       NaN         NaN
 10  1/11/2003  1011.0     12       6.0        50.0}

In [32]:
grp3 = df.groupby('Class').get_group(10)
grp3

       Date  Std ID  Class  Study hr  Percentage
0  1/1/2003  1001.0     10       2.0        50.0
1  1/2/2003  1002.0     10       NaN        60.0
2  1/3/2003     NaN     10       3.0        80.0

In [33]:
grp3 = df.groupby('Percentage').get_group(50)
grp3

         Date  Std ID  Class  Study hr  Percentage
0    1/1/2003  1001.0     10       2.0        50.0
10  1/11/2003  1011.0     12       6.0        50.0

In [34]:
grp1.sum()

       Std ID  Study hr  Percentage
Class
10     2003.0       5.0       190.0
11     1005.0      14.0        80.0
12     5045.0      10.0       285.0

In [35]:
grp1.mean()

       Std ID  Study hr  Percentage
Class
10     1001.5  2.500000   63.333333
11     1005.0  4.666667   80.000000
12     1009.0  5.000000   71.250000

In [36]:
grp1.describe()

      Std ID                                                              \
       count    mean       std     min      25%     50%      75%     max
Class
10       2.0  1001.5  0.707107  1001.0  1001.25  1001.5  1001.75  1002.0
11       1.0  1005.0       NaN  1005.0  1005.00  1005.0  1005.00  1005.0
12       5.0  1009.0  1.581139  1007.0  1008.00  1009.0  1010.00  1011.0

      Study hr            ...             Percentage                        \
         count      mean  ...   75%   max      count       mean        std
Class                     ...
10         2.0  2.500000  ...  2.75   3.0        3.0  63.333333  15.275252
11         3.0  4.666667  ...  7.00  10.0        1.0  80.000000        NaN
12         2.0  5.000000  ...  5.50   6.0        4.0  71.250000  19.311050


        min   25%   50%    75%   max
Class
10     50.0  55.0  60.0  70.00  80.0
11     80.0  80.0  80.0  80.00  80.0
12     50.0  57.5  72.5  86.25  90.0

[3 rows x 24 columns]

In [37]:
grp1.agg(['sum','max','mean']) # aggregate

       Std ID                 Study hr                 Percentage        \
          sum     max    mean      sum   max      mean        sum   max
Class
10     2003.0  1002.0  1001.5      5.0   3.0  2.500000      190.0  80.0
11     1005.0  1005.0  1005.0     14.0  10.0  4.666667       80.0  80.0
12     5045.0  1011.0  1009.0     10.0   6.0  5.000000      285.0  90.0


            mean
Class
10     63.333333
11     80.000000
12     71.250000